Revit 2027 API
BuiltInFailures.SketchFailures.SculptingCurvesTouchAxis Property
 The highlighted curves touch the axis.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId SculptingCurvesTouchAxis { get; }
Public Shared ReadOnly Property SculptingCurvesTouchAxis As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ SculptingCurvesTouchAxis {
	FailureDefinitionId^ get ();
}
static member SculptingCurvesTouchAxis : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace